In [1]:
import pandas as pd

In [16]:
url = r"E:\Project\Anaconda\csv\csv\job_candidates.csv"
df = pd.read_csv(url, usecols=["name", "city", "py-score"])

In [19]:
df.s

     name         city  py-score
0  Xavier  Mexico city      88.0
1     Ann      Toronto      79.0
2    Jana       Prague      81.0
3      Yi     Shanghai      80.0
4   Robin   Manchester      68.0
5    Amal        Cairo      61.0
6    Nori        Osaka      84.0

In [23]:
df[["name", "py-score"]]

     name  py-score
0  Xavier      88.0
1     Ann      79.0
2    Jana      81.0
3      Yi      80.0
4   Robin      68.0
5    Amal      61.0
6    Nori      84.0

In [29]:
name_score = df.loc[:,["name", "py-score"]]
name_score.sort_values(by="py-score", ascending=False)

     name  py-score
0  Xavier      88.0
6    Nori      84.0
2    Jana      81.0
3      Yi      80.0
1     Ann      79.0
4   Robin      68.0
5    Amal      61.0

In [22]:
df.at[0,"\"]

'Mexico city'